--[[
✄╔═╗╔═╗─────╔═══╗──╔══╗──╔════╗dev:@meedo1133
✄║║╚╝║║─────╚╗╔╗║──║╔╗║──║╔╗╔╗║dev:@hema1133
✄║╔╗╔╗╠══╦══╗║║║╠══╣╚╝╚╦═╩╣║║╚╝cha:@meedoyemen
✄║║║║║║║═╣║═╣║║║║╔╗║╔═╗║╔╗║║║  fbk:@mmalhossainy 
✄║║║║║║║═╣║═╬╝╚╝║╚╝║╚═╝║╚╝║║║  gml:meedoyemen@gmail.com
✄╚╝╚╝╚╩══╩══╩═══╩══╩═══╩══╝╚╝  inst:@meedoyemen
]]--
do

function run(msg, matches)
return [[

▫️🖊الـبـوت 🤖الـذي يعمل على المجموعات الخارقه 🚀 

▫️🖊يعمل البووت مع مجموعات خارقه من 5 الف عضو 
👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️👨‍✈️
 🛠≪ تـم صـنـع الـبـوت بـواسـطـه الـمـطـور ≫🔌
   
 👨‍✈️ 📱 آٰلِِقٓٓـــّنَْـاصْ مِِيـــツّـــــدُو 💻 & هيمــــツّـــا
   
                 📲     『  @meedo1133   /n @hema1133 』
                      
▫️📝الـمـطـور : آٰلِِقٓٓـــّنَْـاصْ مِِيـــツّـــــدُو  > @meedo1133
                      
**************************************************

للتواصل مع المطور عبر المعرف التالي 
@meedo1133   /n @hema1133

واذا كنت محظور عبر البوت التالي 
@toasalmeedoBot

قناه المطور 
@meedoyemen

*************************
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
--[[
✄╔═╗╔═╗─────╔═══╗──╔══╗──╔════╗dev:@meedo1133
✄║║╚╝║║─────╚╗╔╗║──║╔╗║──║╔╗╔╗║dev:@hema1133
✄║╔╗╔╗╠══╦══╗║║║╠══╣╚╝╚╦═╩╣║║╚╝cha:@meedoyemen
✄║║║║║║║═╣║═╣║║║║╔╗║╔═╗║╔╗║║║  fbk:@mmalhossainy 
✄║║║║║║║═╣║═╬╝╚╝║╚╝║╚═╝║╚╝║║║  gml:meedoyemen@gmail.com
✄╚╝╚╝╚╩══╩══╩═══╩══╩═══╩══╝╚╝  inst:@meedoyemen
]]--
