
--[[
✄╔═╗╔═╗─────╔═══╗──╔══╗──╔════╗dev:@meedo1133
✄║║╚╝║║─────╚╗╔╗║──║╔╗║──║╔╗╔╗║dev:@hema1133
✄║╔╗╔╗╠══╦══╗║║║╠══╣╚╝╚╦═╩╣║║╚╝cha:@meedoyemen
✄║║║║║║║═╣║═╣║║║║╔╗║╔═╗║╔╗║║║  fbk:@mmalhossainy 
✄║║║║║║║═╣║═╬╝╚╝║╚╝║╚═╝║╚╝║║║  gml:meedoyemen@gmail.com
✄╚╝╚╝╚╩══╩══╩═══╩══╩═══╩══╝╚╝  inst:@meedoyemen
]]--
local function pre_process(msg) 
local link = 'med1:'..msg.to.id      --@meedo1133
local resend = 'med2:'..msg.to.id
local photo = 'med3:'..msg.to.id    --@meedo1133
local audio = 'med4:'..msg.to.id 
local video = 'med5:'..msg.to.id  --@meedo1133
local hka6 = 'med6:'..msg.to.id
local username = 'med7:'..msg.to.id
local sharb = 'med8:'..msg.to.id     --@meedo1133
local lain = 'med9:' ..msg.to.id
local takit = 'med10:'..msg.to.id
local media = 'med11:'..msg.to.id
local smail = 'med12:'..msg.to.id
local ha = msg.text:match("/")
local hhaka = msg.text:match("😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃👫👪👬👭💏💑👯🙆🙅💁🙋💆💇💅👰🙎🙍🙇🎩👑👒👟👞👡👠👢👕👔👚👗🎽👖👘👙💼👜👝👛👓🎀🌂💄💛💙💜💚❤️💔💗💓💕💖💞💘💌💋💍💎👤👥💬👣💭🐶🐺🐱🐭🐹🐰🐸🐯🐨🐻🐷🐽🐮🐗🐵🐒🐴🐑🐘🐼🐧🐦🐤🐥🐣🐔🐍🐢🐛🐝🐜🐞🐌🐙🐚🐠🐟🐬🐳🐋🐄🐏🐀🐃🐅🐇🐉🐎🐐🐓🐕🐖🐁🐂🐲🐡🐊🐫🐪🐆🐈🐩🐾💐🌸🌷🍀🌹🌻🌺🍁🍃🍂🌿🌾🍄🌵🌴🌲🌳🌰🌱🌼🌐🌞🌝🌚🌑🌒🌓🌔🌕🌖🌗🌘🌜🌛🌙🌍🌎🌏🌋🌌🌠⭐️☀️⛅️☁️⚡️☔️❄️⛄️🌀🌁🌈🌊🎍💝🎎🎒🎓🎏🎆🎇🎐🎑🎃👻🎅🎄🎁🎋🎉🎊🎈🎌🔮🎥📷📹📼💿📀💽💾💻📱☎️📞📟📠📡📺📻🔊🔉🔈🔇🔔🔕📢📣⏳⌛️⏰⌚️🔓🔒🔏🔐🔑🔎💡🔦🔆🔅🔌🔋🔍🛁🛀🚿🚽🔧🔩🔨🚪🚬💣🔫🔪💊💉💰💴💵💷💶💳💸📲📧📥📤✉️📩📨📯📫📪📬📭📮📦📝📄📃📑📊📈📉📜📋📅📆📇📁📂✂️📌📎✒️✏️📏📐📕📗📘📙📓📔📒📚📖🔖📛🔬🔭📰🎨🎬🎤🎧🎼🎵🎶🎹🎻🎺🎷🎸👾🎮🃏🎴🀄️🎲🎯🏈🏀⚽️⚾️🎾🎱🏉🎳⛳️🚵🚴🏁🏇🏆🎿🏂🏊🏄🎣☕️🍵🍶🍼🍺🍻🍸🍹🍷🍴🍕🍔🍟🍗🍖🍝🍛🍤🍱🍣🍥🍙🍘🍚🍜🍲🍢🍡🍳🍞🍩🍮🍦🍨🍧🎂🍰🍪🍫🍬🍭🍯🍎🍏🍊🍋🍒🍇🍉🍓🍑🍈🍌🍐🍍🍠🍆🍅🌽🏠🏡🏫🏢🏣🏥🏦🏪🏩🏨💒⛪️🏬🏤🌇🌆🏯🏰⛺️🏭🗼🗾🗻🌄🌅🌃🗽🌉🎠🎡⛲️🎢🚢⛵️🚤🚣⚓️🚀✈️💺🚁🚂🚊🚉🚞🚆🚄🚅🚈🚇🚝🚋🚃🚎🚌🚍🚙🚘🚗🚕🚖🚛🚚🚨🚓🚔🚒🚑🚐🚲🚡🚟🚠🚜💈🚏🎫🚦🚥⚠️🚧🔰⛽️🏮🎰♨️🗿🎪🎭📍🚩🇯🇵🇰🇷🇩🇪🇨🇳🇺🇸🇫🇷🇪🇸🇮🇹🇷🇺🇬🇧1⃣2⃣3⃣4⃣5⃣6⃣7⃣8⃣9⃣0⃣🔟🔢#⃣🔣⬆️⬇️⬅️➡️🔠🔡🔤↗️↖️↘️↙️↔️↕️🔄◀️▶️🔼🔽↩️↪️ℹ️⏪⏩⏫⏬⤵️⤴️🆗🔀🔁🔂🆕🆙🆒🆓🆖📶🎦🈁🈯️🈳🈵🈴🈲🉐🈹🈺🈶🈚️🚻🚹🚺🚼🚾🚰🚮🅿️♿️🚭🈷🈸🈂Ⓜ️🛂🛄🛅🛃🉑㊙️㊗️🆑🆘🆔🚫🔞📵🚯🚱🚳🚷🚸⛔️✳️❇️❎✅✴️💟🆚📳📴🅰🅱🆎🅾💠➿♻️♈️♉️♊️♋️♌️♍️♎️♏️♐️♑️♒️♓️⛎🔯🏧💹💲💱©®™❌‼️⁉️❗️❓❕❔⭕️🔝🔚🔙🔛🔜🔃🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕖🕗🕘🕙🕚🕡🕢🕣🕤🕥🕦✖️➕➖➗♠️♥️♣️♦️💮💯✔️☑️🔘🔗➰〰〽️🔱◼️◻️◾️◽️▪️▫️🔺🔲🔳⚫️⚪️🔴🔵🔻⬜️⬛️🔶🔷🔸🔹😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃👫👪👬👭💏💑👯🙆🙅💁🙋💆💇💅👰🙎🙍🙇🎩👑👒👟👞👡👠👢👕👔👚👗🎽👖👘👙💼👜👝👛👓🎀🌂💄💛💙💜💚❤️💔💗💓💕💖💞💘💌💋💍💎👤👥💬👣💭🐶🐺🐱🐭🐹🐰🐸🐯🐨🐻🐷🐽🐮🐗🐵🐒🐴🐑🐘🐼🐧🐦🐤🐥🐣🐔🐍🐢🐛🐝🐜🐞🐌🐙🐚🐠🐟🐬🐳🐋🐄🐏🐀🐃🐅🐇🐉🐎🐐🐓🐕🐖🐁🐂🐲🐡🐊🐫🐪🐆🐈🐩🐾💐🌸🌷🍀🌹🌻🌺🍁🍃🍂🌿🌾🍄🌵🌴🌲🌳🌰🌱🌼🌐🌞🌝🌚🌑🌒🌓🌔🌕🌖🌗🌘🌜🌛🌙🌍🌎🌏🌋🌌🌠⭐️☀️⛅️☁️⚡️☔️❄️⛄️🌀🌁🌈🌊🎍💝🎎🎒🎓🎏🎆🎇🎐🎑🎃👻🎅🎄🎁🎋🎉🎊🎈🎌🔮🎥📷📹📼💿📀💽💾💻📱☎️📞📟📠📡📺📻🔊🔉🔈🔇🔔🔕📢📣⏳⌛️⏰⌚️🔓🔒🔏🔐🔑🔎💡🔦🔆🔅🔌🔋🔍🛁🛀🚿🚽🔧🔩🔨🚪🚬💣🔫🔪💊💉💰💴💵💷💶💳💸📲📧📥📤✉️📩📨📯📫📪📬📭📮📦📝📄📃📑📊📈📉📜📋📅📆📇📁📂✂️📌📎✒️✏️📏📐📕📗📘📙📓📔📒📚📖🔖📛🔬🔭📰🎨🎬🎤🎧🎼🎵🎶🎹🎻🎺🎷🎸👾🎮🃏🎴🀄️🎲🎯🏈🏀⚽️⚾️🎾🎱🏉🎳⛳️🚵🚴🏁🏇🏆🎿🏂🏊🏄🎣☕️🍵🍶🍼🍺🍻🍸🍹🍷🍴🍕🍔🍟🍗🍖🍝🍛🍤🍱🍣🍥🍙🍘🍚🍜🍲🍢🍡🍳🍞🍩🍮🍦🍨🍧🎂🍰🍪🍫🍬🍭🍯🍎🍏🍊🍋🍒🍇🍉🍓🍑🍈🍌🍐🍍🍠🍆🍅🌽🏠🏡🏫🏢🏣🏥🏦🏪🏩🏨💒⛪️🏬🏤🌇🌆🏯🏰⛺️🏭🗼🗾🗻🌄🌅🌃🗽🌉🎠🎡⛲️🎢🚢⛵️🚤🚣⚓️🚀✈️💺🚁🚂🚊🚉🚞🚆🚄🚅🚈🚇🚝🚋🚃🚎🚌🚍🚙🚘🚗🚕🚖🚛🚚🚨🚓🚔🚒🚑🚐🚲🚡🚟🚠🚜💈🚏🎫🚦🚥⚠️🚧🔰⛽️🏮🎰♨️🗿🎪🎭📍🚩🇯🇵🇰🇷🇩🇪🇨🇳🇺🇸🇫🇷🇪🇸🇮🇹🇷🇺🇬🇧1⃣2⃣3⃣4⃣5⃣6⃣7⃣8⃣9⃣0⃣🔟🔢#⃣🔣⬆️⬇️⬅️➡️🔠🔡🔤↗️↖️↘️↙️↔️↕️🔄◀️▶️🔼🔽↩️↪️ℹ️⏪⏩⏫⏬⤵️⤴️🆗🔀🔁🔂🆕🆙🆒🆓🆖📶🎦🈁🈯️🈳🈵🈴🈲🉐🈹🈺🈶🈚️🚻🚹🚺🚼🚾🚰🚮🅿️♿️🚭🈷🈸🈂Ⓜ️🛂🛄🛅🛃🉑㊙️㊗️🆑🆘🆔🚫🔞📵🚯🚱🚳🚷🚸⛔️✳️❇️❎✅✴️💟🆚📳📴🅰🅱🆎🅾💠➿♻️♈️♉️♊️♋️♌️♍️♎️♏️♐️♑️♒️♓️⛎🔯🏧💹💲💱©®™❌‼️⁉️❗️❓❕❔⭕️🔝🔚🔙🔛🔜🔃🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕖🕗🕘🕙🕚🕡🕢🕣🕤🕥🕦✖️➕➖➗♠️♥️♣️♦️💮💯✔️☑️🔘🔗➰〰〽️🔱◼️◻️◾️◽️▪️▫️🔺🔲🔳⚫️⚪️🔴🔵🔻⬜️⬛️🔶🔷🔸🔹😄😃😀😊☺️😉😍😘😚😗😙😜😝😛😳😁😔😌😒😞😣😢😂😭😪😥😰😅😓😩😫😨😱😠😡😤😖😆😋😷😎😴😵😲😟😦😧😈👿😮😬😐😕😯😶😇😏😑👲👳👮👷💂👶👦👧👨👩👴👵👱👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💀👽💩🔥✨🌟💫💥💢💦💧💤💨👂👀👃👅👄👍👎👌👊✊✌👋✋👐👆👇👉👈🙌🙏☝️👏💪🚶🏃💃")
local hk = msg.text:match("@") 
local hb = msg.text:match("#")
local hka = msg.text:match("[Hh][Tt][Tt][Pp][Ss]://") or msg.text:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]%.[Mm][Ee]/") or msg.text:match("[Tt][Ll][Gg][Rr][Mm]%.[Mm][Ee]/") or msg.text:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]%.[Oo][Rr][Gg]") or msg.text:match("[Gg][Oo][Oo]%.[Gg][Li]/")  or msg.text:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm]%.[Mm][Ee]") or msg.text:match("(https://t.me/)") or msg.text:match("[Tt].[Mm][Ee]/")--@meedo1133
if redis:get(link) and not is_momod(msg) and hka then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـروابـط 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(username) and not is_momod(msg) and hk then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـمـعـرفـات 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(takit) and not is_momod(msg) and hb then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـتـاكـات 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(resend) and not is_momod(msg) and msg.fwd_from then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع عــمــل الـتـوجـيـه 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username)
elseif redis:get(photo) and not is_momod(msg) and msg.media and msg.media.type == 'photo' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـصـور 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(audio) and not is_momod(msg) and msg.media and msg.media.type == 'audio' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـصـوت 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(video) and not is_momod(msg) and msg.media and msg.media.type == 'video' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الفـيـديـو 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(smail) and not is_momod(msg) and hhaka then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـسـمـايـلات 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(hka6) and not is_momod(msg) and msg.to.type == 'channel' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوعـه الـدردشـه 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(sharb) and not is_momod(msg) and ha then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الشـارحـه 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(lain) and not is_momod(msg) and msg.text == '[unsupported]' then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـانـلاينـ 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
elseif redis:get(media) and not is_momod(msg) and msg.media then
delete_msg(msg.id, ok_cb, true)
send_large_msg(get_receiver(msg), '#تـنـبـيـه ⚠️\nمـمـنـوع ارسـال #الـمـيـديـا 🔕 داخـــل الــمــجــمــوعــة 👥✔️\n#المعرف @'..msg.from.username or '')
return "done"
   end --@meedo1133
   return msg
 end
 
 
local function meedo1133(msg, matches) 
    chat_id =  msg.to.id 
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الروابط بالتحذير' then
   local link = 'med1:'..msg.to.id  
    redis:set(link, true)
return '#لقد تم ☑️ قـفـل #الـروابـط بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الروابط بالتحذير' then
   local link = 'med1:'..msg.to.id  
    redis:del(link)
return '#لقد تم ⚠️ تفعيل  #الـروابـط بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
        --@meedo1133
end

if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'التوجيه بالتحذير' then
   local resend = 'med2:'..msg.to.id  --@meedo1133
    redis:set(resend, true)
return '#لقد تم ☑️ قـفـل #الـتـوجـيـه بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'التوجيه بالتحذير' then
   local resend = 'med2:'..msg.to.id 
    redis:del(resend)
return '#لقد تم ⚠️ تفعيل  #الـتـوجـيـه بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الصور بالتحذير' then
  local photo = 'med3:'..msg.to.id 
    redis:set(photo, true)
return '#لقد تم ☑️ قـفـل #الـصـور بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الصور بالتحذير' then
    local photo = 'med3:'..msg.to.id 
    redis:del(photo)
return '#لقد تم ⚠️ تفعيل  #الـصـور بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الصوت بالتحذير' then
   local audio =  'med4:'..msg.to.id 
    redis:set(audio, true)
return '#لقد تم ☑️ قـفـل #الـصـوت بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الصوت بالتحذير' then
  local audio =  'med4:'..msg.to.id 
    redis:del(audio) --@meedo1133
return '#لقد تم ⚠️ فـتـح #الـصـوت بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الفيديو بالتحذير' then
  local video = 'med5:'..msg.to.id
    redis:set(video, true)
return '#لقد تم ☑️ قـفـل #الفـيـديـو بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الفيديو بالتحذير'  then
 local video = 'med5:'..msg.to.id
    redis:del(video) --@meedo1133
return '#لقد تم ⚠️ تفعيل  #الفـيـديـو بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الدردشه بالتحذير'  then
 local hka6 = 'med6:'..msg.to.id
    redis:set(hka6, true)
return '#لقد تم ☑️ قـفـل #الـدردشـه بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الدردشه بالتحذير'  then
 local hka6 = 'med6:'..msg.to.id
    redis:del(hka6) --@meedo1133
return '#لقد تم ⚠️ تفعيل  #الـدردشـه بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'المعرف بالتحذير'  then
 local username = 'med7:'..msg.to.id
    redis:set(username, true)
return '#لقد تم ☑️ قـفـل #الـمـعـرف بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'المعرف بالتحذير'  then
local username = 'med7:'..msg.to.id
    redis:del(username) --@meedo1133
return '#لقد تم ⚠️ تفعيل  #الـمـعـرف بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end

if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الشارحه بالتحذير'  then
  local sharb = 'med8:'..msg.to.id
    redis:set(sharb, true)
return '#لقد تم ☑️ قـفـل #الـشـارحـه بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الشارحه بالتحذير'  then
   local sharb = 'med8:'..msg.to.id
    redis:del(sharb)
return '#لقد تم ⚠️ تفعيل  #الـشـارحـه بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الانلاين بالتحذير' then
  local lain = 'med9:' ..msg.to.id
    redis:set(lain, true)
return '#لقد تم ☑️ قـفـل #الـانـلايـنـ بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'الانلاين بالتحذير' then
  local lain = 'med9:' ..msg.to.id
    redis:del(lain)  --@meedo1133
return '#لقد تم ⚠️ تفعيل  #الـانـلايـنـ بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'التاك بالتحذير' then
  local takit = 'med10:'..msg.to.id
    redis:set(takit, true)
return '#لقد تم ☑️ قـفـل #الـتـاكـ بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]== 'التاك بالتحذير' then
 local takit = 'med10:'..msg.to.id
    redis:del(takit)  --@meedo1133
return '#لقد تم ⚠️ تفعيل  #الـتـاكـ بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
    
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'السمايل بالتحذير'  then
 local  smail = 'med12:'..msg.to.id
    redis:set(smail, true)
return '#لقد تم ☑️ قـفـل #الـسـمـايـل بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]==  'السمايل بالتحذير'  then
 local  smail = 'med12:'..msg.to.id
    redis:del(smail)  --@meedo1133
return '#لقد تم ⚠️ تفعيل  #الـسـمـايـل بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
if is_momod(msg) and matches[1]== 'قفل' and matches[2]== 'الميديا بالتحذير'  then
 local  media = 'med11:'..msg.to.id
    redis:set(media, true)
return '#لقد تم ☑️ قـفـل #الـمـيـديـا بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'
 elseif is_momod(msg) and matches[1]== 'فتح' and matches[2]==  'الميديا بالتحذير'  then
 local  media = 'med11:'..msg.to.id
    redis:del(media)  --@meedo1133
return '#لقد تم ⚠️ تفعيل  #الـمـيـديـا بـالـتـحـذيـر 📛 فـي | '..msg.to.title..' |\n#عن طريق  |❗️| (@'..(msg.from.username or 'لا يوجد')..')\n'       
end
----------الاعدادات-------------

if matches[1] == "اعدادات التحذير" and is_momod(msg) then
local link = 'med1:'..msg.to.id      --@meedo1133
local resend = 'med2:'..msg.to.id
local photo = 'med3:'..msg.to.id    --@meedo1133
local audio = 'med4:'..msg.to.id 
local video = 'med5:'..msg.to.id  --@meedo1133
local hka6 = 'med6:'..msg.to.id
local username = 'med7:'..msg.to.id
local sharb = 'med8:'..msg.to.id     --@meedo1133
local lain = 'med9:' ..msg.to.id
local takit = 'med10:'..msg.to.id
local media = 'med11:'..msg.to.id
local smail = 'med12:'..msg.to.id
-- -- -- --
local settings_tshake = 'اعـداداتـ الـتـحـذيـر فـي\n'..msg.to.title..'\n'
.."|📡| #الـانـلـايـنـ | "..(redis:get(lain) or "false").."\n"
.."|🗼| #الـصـور | "..(redis:get(photo) or "false").."\n"
.."|🎤| #الـصـوتـ | "..(redis:get(audio) or "false").."\n\n"
.."|🎥| #الـفـيـديـو | "..(redis:get(video) or "false").."\n"
.."|↪️| #التوجيه | "..(redis:get(resend) or "false").."\n"
.."|〰| #الـشـارحـه | "..(redis:get(sharb) or "false").."\n"
.."|⚠️| #الـروابـط | "..(redis:get(link) or "false").."\n\n"
.."|🌀| #الـمعـرفـاتـ | "..(redis:get(username) or "false").."\n"
.."|#⃣| #الـتـاكـاتـ | "..(redis:get(takit) or "false").."\n"
.."|😴| #الـسـمـايـلـاتـ | "..(redis:get(smail) or "false").."\n"
.."|🎐| #الـمـيـديـا | "..(redis:get(media) or "false").."\n"
return settings_tshake
end
end
return {
    patterns = {
        '^(اعدادات التحذير)$',
        '^(قفل) (الروابط بالتحذير)$',
        '^(فتح) (الروابط بالتحذير)$',
        '^(قفل) (التوجيه بالتحذير)$',
        '^(فتح) (التوجيه بالتحذير)$',
        '^(قفل) (الصور بالتحذير)$',
        '^(فتح) (الصور بالتحذير)$',
        '^(قفل) (الصوت بالتحذير)$',
        '^(فتح) (الصوت بالتحذير)$',
        '^(قفل) (الفيديو بالتحذير)$',
        '^(فتح) (الفيديو بالتحذير)$',
        '^(قفل) (الدردشه بالتحذير)$',
        '^(فتح) (الدردشه بالتحذير)$',
        '^(قفل) (المعرف بالتحذير)$',
        '^(فتح) (المعرف بالتحذير)$',
        '^(قفل) (الشارحه بالتحذير)$',
        '^(فتح) (الشارحه بالتحذير)$',
        '^(قفل) (الانلاين بالتحذير)$',
        '^(فتح) (الانلاين بالتحذير)$',
        '^(قفل) (التاك بالتحذير)$',
        '^(فتح) (التاك بالتحذير)$',
        '^(قفل) (السمايل بالتحذير)$',
        '^(فتح) (السمايل بالتحذير)$',
        '^(قفل) (الميديا بالتحذير)$',
        '^(فتح) (الميديا بالتحذير)$',
    },
    run = meedo1133,
    pre_process = pre_process
}

--[[
✄╔═╗╔═╗─────╔═══╗──╔══╗──╔════╗dev:@meedo1133
✄║║╚╝║║─────╚╗╔╗║──║╔╗║──║╔╗╔╗║dev:@hema1133
✄║╔╗╔╗╠══╦══╗║║║╠══╣╚╝╚╦═╩╣║║╚╝cha:@meedoyemen
✄║║║║║║║═╣║═╣║║║║╔╗║╔═╗║╔╗║║║  fbk:@mmalhossainy 
✄║║║║║║║═╣║═╬╝╚╝║╚╝║╚═╝║╚╝║║║  gml:meedoyemen@gmail.com
✄╚╝╚╝╚╩══╩══╩═══╩══╩═══╩══╝╚╝  inst:@meedoyemen
]]--
